doe/doe_base_60deg/0/omega
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
dimensions  [0 0 -1 0 0 0 0];
internalField   uniform 35;

// DoE tokens (replaced per-case by stamp_cases.py) :
//    @OMEGA_MAIN@     = k^0.5 / (C_mu^0.25 * L_main)       [1/s]
//    @OMEGA_BRANCH@   = k^0.5 / (C_mu^0.25 * L_branch)     [1/s]
//    @MIX_BRANCH@     = 0.07 * D2                          [m]
// Mixing length  L = 0.07 * D  per Versteeg & Malalasekera 2007 Eq. 3.64
// and C_mu = 0.09 (k-omega SST standard).

boundaryField
{
    main_inlet
    {
        type            turbulentMixingLengthFrequencyInlet;
        mixingLength    0.0322;           // 0.07 * 0.460
        value           uniform @OMEGA_MAIN@;
    }
    branch_inlet
    {
        type            turbulentMixingLengthFrequencyInlet;
        mixingLength    @MIX_BRANCH@;
        value           uniform @OMEGA_BRANCH@;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform @OMEGA_MAIN@;
        value           uniform @OMEGA_MAIN@;
    }
    wall
    {
        type            omegaWallFunction;
        value           uniform @OMEGA_MAIN@;
    }
    sym { type symmetryPlane; }
}
